GoulongWang/RA8M1-main-2/lib/utils/utils.h
#define bench_PMU8(CALL, EV0, EV1, EV2, EV3, EV4, EV5, EV6, EV7)                                                     \
    do {                                                                                                             \
        __disable_irq();                                                                                             \
                                                                                                                     \
        ARM_PMU_Set_EVTYPER(0, EV0);                                                                                 \
        ARM_PMU_Set_EVTYPER(1, EV1);                                                                                 \
        ARM_PMU_Set_EVTYPER(2, EV2);                                                                                 \
        ARM_PMU_Set_EVTYPER(3, EV3);                                                                                 \
        ARM_PMU_Set_EVTYPER(4, EV4);                                                                                 \
        ARM_PMU_Set_EVTYPER(5, EV5);                                                                                 \
        ARM_PMU_Set_EVTYPER(6, EV6);                                                                                 \
        ARM_PMU_Set_EVTYPER(7, EV7);                                                                                 \
                                                                                                                     \
        ARM_PMU_EVCNTR_ALL_Reset();                                                                                  \
        ARM_PMU_CYCCNT_Reset();                                                                                      \
                                                                                                                     \
        ARM_PMU_CNTR_Enable(                                                                                         \
            PMU_CNTENSET_CCNTR_ENABLE_Msk | PMU_CNTENSET_CNT0_ENABLE_Msk | PMU_CNTENSET_CNT1_ENABLE_Msk |            \
            PMU_CNTENSET_CNT2_ENABLE_Msk | PMU_CNTENSET_CNT3_ENABLE_Msk | PMU_CNTENSET_CNT4_ENABLE_Msk |             \
            PMU_CNTENSET_CNT5_ENABLE_Msk | PMU_CNTENSET_CNT6_ENABLE_Msk | PMU_CNTENSET_CNT7_ENABLE_Msk);             \
        CALL;                                                                                                        \
        ARM_PMU_CNTR_Disable(                                                                                        \
            PMU_CNTENCLR_CCNTR_ENABLE_Msk | PMU_CNTENCLR_CNT0_ENABLE_Msk | PMU_CNTENCLR_CNT1_ENABLE_Msk |            \
            PMU_CNTENCLR_CNT2_ENABLE_Msk | PMU_CNTENCLR_CNT3_ENABLE_Msk | PMU_CNTENCLR_CNT4_ENABLE_Msk |             \
            PMU_CNTENCLR_CNT5_ENABLE_Msk | PMU_CNTENCLR_CNT6_ENABLE_Msk | PMU_CNTENCLR_CNT7_ENABLE_Msk);             \
                                                                                                                     \
        printf(#CALL ": cycles = %" PRIu32 ", " #EV0 " = %" PRIu32 ", " #EV1 " = %" PRIu32 ", " #EV2 " = %" PRIu32   \
                     ", " #EV3 " = %" PRIu32 ", " #EV4 " = %" PRIu32 ", " #EV5 " = %" PRIu32 ", " #EV6 " = %" PRIu32 \
                     ", " #EV7 " = %" PRIu32 "\n",                                                                   \
               ARM_PMU_Get_CCNTR(), ARM_PMU_Get_EVCNTR(0), ARM_PMU_Get_EVCNTR(1), ARM_PMU_Get_EVCNTR(2),             \
               ARM_PMU_Get_EVCNTR(3), ARM_PMU_Get_EVCNTR(4), ARM_PMU_Get_EVCNTR(5), ARM_PMU_Get_EVCNTR(6),           \
               ARM_PMU_Get_EVCNTR(7));                                                                               \
                                                                                                                     \
        __enable_irq();                                                                                              \
    }                                                                                                                \
    while (0)
